Repository: Bat-cyla/symmetrical-pancake
Catalog: var/langs/*/addons/ab__stickers.po
Languages: ru_ru

# Addons::name::ab__stickers
source: AB: Stickers
ru_ru: AB: Стикеры

# Addons::description::ab__stickers
source: Add-on allows to add product stickers
ru_ru: Модуль позволяет добавить стикеры к товарам

# Languages::ab__stickers
source: AB: Stickers
ru_ru: AB: Стикеры

# Languages::ab__stickers.settings
source: General settings
ru_ru: Общие настройки

# SettingsSections::ab__stickers::settings
source: General
ru_ru: Общие

# SettingsSections::ab__stickers::text_stickers
source: Text stickers
ru_ru: Текстовые стикеры

# SettingsSections::ab__stickers::vendors
source: Vendors
ru_ru: Продавцы

# SettingsSections::ab__stickers::graphic_stickers
source: Graphic stickers
ru_ru: Графические стикеры

# SettingsOptions::ab__stickers::ts_appearance
source: Appearance
ru_ru: Внешний вид

# SettingsTooltips::ab__stickers::ts_appearance
source: Defines the appearence of text stickers
ru_ru: Определяет, как будут выглядеть текстовые стикеры

# SettingsOptions::ab__stickers::gs_image_size_in_lists
source: Icon size in product lists, px
ru_ru: Размер иконки в списках товаров, px

# SettingsTooltips::ab__stickers::gs_image_size_in_lists
source: Defines icon size in product lists
ru_ru: Определяет размер иконки в списках товаров

# SettingsOptions::ab__stickers::gs_image_size_on_product_pages
source: Icon size on product pages, px
ru_ru: Размер иконки на страницах товаров, px

# SettingsTooltips::ab__stickers::gs_image_size_on_product_pages
source: Defines icon size on product pages
ru_ru: Определяет размер иконки на страницах товаров

# SettingsOptions::ab__stickers::output_position
source: Output position
ru_ru: Позиция отображения

# SettingsTooltips::ab__stickers::output_position
source: Please note, for RTL languages ​​- the meaning will be opposite
ru_ru: Обратите внимание, что для RTL языков - значение будет противоположным

# SettingsVariants::ab__stickers::output_position::L
source: Left
ru_ru: Слева

# SettingsVariants::ab__stickers::output_position::R
source: Right
ru_ru: Справа

# SettingsOptions::ab__stickers::enable_for_vendors
source: Allow vendors to manage stickers
ru_ru: Разрешить продавцам управлять стикерами

# SettingsSections::ab__stickers::pictograms
source: Pictograms
ru_ru: Пиктограммы

# SettingsOptions::ab__stickers::p_appearance
source: Appearance
ru_ru: Внешний вид

# SettingsTooltips::ab__stickers::p_appearance
source: Defines how pictograms will look
ru_ru: Определяет, как будут выглядеть пиктограммы

# Languages::ab__stickers.help
source: Help
ru_ru: Справка

# Languages::ab__stickers.help.docs
source: Read <a target='_blank' href='https://cs-cart.alexbranding.com/en/ab__stickers.doc'>the documentation</a>.
ru_ru: Ознакомиться с <a target='_blank' href='https://cs-cart.alexbranding.com/ru/ab__stickers.doc'>документацией</a>.

# Languages::privilege_groups.ab__stickers
source: AB: Stickers
ru_ru: AB: Стикеры

# Languages::ab__stickers.output_type
source: Stickers output type
ru_ru: Способ отображения стикеров

# Languages::ab__stickers.output_type.tooltip
source: The setting allows to specify how the sticker list will be presented in each corner (upper left, upper right, lower left and lower right) of the product grid template "Grid" and in the product image block on the product page
ru_ru: Настройка позволяет указать каким образом будет представлен список стикеров в каждом углу (верхний левый, верхний правый, нижний левый и нижний правый) товарной плитки шаблона "Сетка" и в блоке изображений товара на странице товара

# Languages::ab__stickers.output_type.column
source: Column
ru_ru: В колонку

# Languages::ab__stickers.output_type.row
source: Row
ru_ru: В строку

# Languages::ab__stickers.output_positions
source: Positions
ru_ru: Позиции

# Languages::ab__stickers.output_position.list
source: Positions in product lists
ru_ru: Позиции в списках товаров

# Languages::ab__stickers.output_position.detailed_page
source: Positions on product page
ru_ru: Позиции на странице товара

# Languages::ab__stickers.output_position.AP
source: All positions
ru_ru: Все позиции

# Languages::ab__stickers.output_position.TL
source: Upper left corner
ru_ru: Верхний левый угол

# Languages::ab__stickers.output_position.TR
source: Upper right corner
ru_ru: Верхний правый угол

# Languages::ab__stickers.output_position.BL
source: Lower left corner
ru_ru: Нижний левый угол

# Languages::ab__stickers.output_position.BR
source: Lower right corner
ru_ru: Нижний правый угол

# Languages::ab__stickers.output_position.T
source: Upper corner
ru_ru: Верхний угол

# Languages::ab__stickers.output_position.B
source: Lower corner
ru_ru: Нижний угол

# Languages::ab__stickers.manage
source: Sticker list
ru_ru: Список стикеров

# Languages::ab__stickers.update
source: Sticker managing
ru_ru: Управление стикером

# Languages::ab__stickers.manage.add.dynamic
source: Add dynamic sticker
ru_ru: Добавить динамический стикер

# Languages::ab__stickers.manage.add.constant
source: Add static sticker
ru_ru: Добавить статический стикер

# Languages::ab__stickers.manage.edit
source: Edit sticker
ru_ru: Редактировать стикер

# Languages::ab__stickers.manage.remove_links
source: Remove all links with the objects
ru_ru: Удалить все связи с объектами

# Languages::ab__stickers.params.name
source: Name
ru_ru: Название

# Languages::ab__stickers.params.status
source: Status
ru_ru: Статус

# Languages::ab__stickers.params.type
source: Type
ru_ru: Тип

# Languages::ab__stickers.params.type.A
source: All types
ru_ru: Все типы

# Languages::ab__stickers.params.type.C
source: Static sticker
ru_ru: Статический стикер

# Languages::ab__stickers.params.type.D
source: Dynamic sticker
ru_ru: Динамичекий стикер

# Languages::ab__stickers.params.type.category
source: Category sticker
ru_ru: Стикер категории

# Languages::ab__stickers.params.type.product
source: Product sticker
ru_ru: Стикер товара

# Languages::ab__stickers.params.position
source: Position
ru_ru: Позиция

# Languages::ab__stickers.params.class
source: User-defined CSS-class
ru_ru: Пользовательский CSS-класс

# Languages::ab__stickers.params.available_use
source: Validity period
ru_ru: Период действия

# Languages::ab__stickers.params.available_from
source: Available from
ru_ru: Период действия с

# Languages::ab__stickers.params.available_to
source: Available till
ru_ru: Период дейтсвия по

# Languages::ab__stickers.params.color
source: Text color
ru_ru: Цвет текста

# Languages::ab__stickers.params.color.tooltip
source: Please, select the checkbox to use your own color
ru_ru: Установите флажок, чтобы использовать собственный цвет

# Languages::ab__stickers.params.background
source: Background color
ru_ru: Цвет фона

# Languages::ab__stickers.params.background.tooltip
source: Please, select the checkbox to use your own color
ru_ru: Установите флажок, чтобы использовать собственный цвет

# Languages::ab__stickers.params.link_count
source: Links
ru_ru: Связи

# Languages::ab__stickers.params.link_count.tooltip
source: Number of linked objects to the sticker
ru_ru: Количество привязанных объектов к стикеру

# Languages::ab__stickers.new_sticker
source: New sticker
ru_ru: Новый стикер

# Languages::ab__stickers.name.tooltip
source: This field value will be displayed on
ru_ru: Значение данного поля будет отображаться на устройствах типа

# Languages::ab__stickers.name_for_desktop
source: Text for full view
ru_ru: Текст для полного вида

# Languages::ab__stickers.name_for_desktop.tooltip
source: This field value will be displayed on Desktop and Tablet devices (recommended for templates with big product images)
ru_ru: Значение данного поля будет отображаться на устройствах типа ПК и Планшет (рекомендуется для шаблонов с крупными изображениями товаров)

# Languages::ab__stickers.name_for_mobile
source: Text for short view
ru_ru: Текст для сокращенного вида

# Languages::ab__stickers.name_for_mobile.tooltip
source: This field value will be displayed on Phone devices (recommended for templates with small product images)
ru_ru: Значение данного поля будет отображаться на устройствах типа Смартфон (рекомендуется для шаблонов с мелкими изображениями товаров)

# Languages::ab__stickers.attached_products
source: Attached products
ru_ru: Прикрепленные товары

# Languages::ab__stickers.style
source: Style
ru_ru: Стиль

# Languages::ab__stickers.style.T
source: Text
ru_ru: Текстовый

# Languages::ab__stickers.style.G
source: Graphic
ru_ru: Графический

# Languages::ab__stickers.style.P
source: Pictogram
ru_ru: Пиктограмма

# Languages::ab__stickers.text_color
source: Text color
ru_ru: Цвет текста

# Languages::ab__stickers.sticker_bg
source: Background color
ru_ru: Цвет фона

# Languages::ab__stickers.editing_sticker
source: Sticker managing
ru_ru: Управление стикером

# Languages::ab__stickers.deleted_stickers
source: [n] sticker is deleted|[n] stickers are deleted
ru_ru: [n] стикер удален|[n] стикера удалено|[n] стикеров удалено

# Languages::ab__stickers.cloned_stickers
source: [n] sticker was cloned|[n] stickers were cloned
ru_ru: [n] стикер дублирован|[n] стикера дублированы|[n] стикеров дублировано

# Languages::ab__stickers.cloned
source: [Cloned]
ru_ru: [Дублированный]

# Languages::ab__stickers.description
source: Description
ru_ru: Описание

# Languages::ab__stickers.description.tooltip
source: This field value will be displayed when hover mouse pointer
ru_ru: Значение данного поля будет отображено при наведении мышью на стикер

# Languages::ab__stickers.group_conditions
source: If [set] of these conditions [set_value]
ru_ru: Если [set] из этих условий [set_value]

# Languages::ab__stickers.conditions.all
source: every
ru_ru: каждое

# Languages::ab__stickers.conditions.any
source: any
ru_ru: любое

# Languages::ab__stickers.conditions.true
source: are true
ru_ru: выполняется

# Languages::ab__stickers.conditions.false
source: are false
ru_ru: не выполняется

# Languages::ab__stickers.conditions.names.price
source: Product price
ru_ru: Цена товара

# Languages::ab__stickers.conditions.names.feature
source: Product feature
ru_ru: Характеристика товара

# Languages::ab__stickers.conditions.names.categories
source: Categories
ru_ru: Категории

# Languages::ab__stickers.conditions.names.tags
source: Product tag
ru_ru: Тег товара

# Languages::ab__stickers.conditions.names.discount
source: Discount, %
ru_ru: Скидка, %

# Languages::ab__stickers.conditions.names.vendor_plans
source: Vendor plan
ru_ru: Тарифный план продавца

# Languages::ab__stickers.avail_from
source: Available from
ru_ru: Доступен с

# Languages::ab__stickers.avail_till
source: Available to
ru_ru: Доступен до

# Languages::ab__stickers.storefronts.sticker_page.description
source: Select the storefronts for which this sticker will be applied
ru_ru: Выберите витрины, для которых будет применен данный стикер

# Languages::ab__stickers.search_by
source: Search by AB: Stickers
ru_ru: Поиск по AB: Стикерам

# Languages::ab__stickers.available_placeholders
source: The following placeholders are available for fields "Text for full view", "Text for short view", "Description"
ru_ru: Вам также доступны следующие плейсхолдеры для полей "Текст для полного вида", "Текст для сокращенного вида", "Описание"

# Languages::ab__stickers.conditions.placeholders.discount
source: The discount value in percents
ru_ru: Значение скидки в процентах

# Languages::ab__stickers.conditions.names.free_shipping
source: Free shipping
ru_ru: Бесплатная доставка

# Languages::ab__stickers.will_used_default
source: Default stickers of active theme will be used
ru_ru: Будут использованы стандартные стикеры используемой темы

# Languages::ab__stickers.you_have_no_standart_stickers
source: You need to create Discount and Free Shipping stickers or add Demo data in the "AB: Stickers" add-on, because when the add-on is activated, it intercepts the display of basic CS-Cart labels
ru_ru: Вам необходимо создать стикеры Скидка и Бесплатная доставка или добавить Демо-данные в модуле "AB: Стикеры", поскольку при активации модуля он перехватывает показ базовых стикеров CS-Cart

# Languages::ab__stickers.conditions.names.qty_discounts
source: Quantity discounts
ru_ru: Оптовые скидки

# Languages::ab__stickers.conditions.placeholders.min_qty_discount_count
source: Minimal products quantity for quantity discount
ru_ru: Минимальное количество товаров для оптовой скидки

# Languages::ab__stickers.conditions.placeholders.min_qty_discount_price
source: Minimal products price with quantity discount
ru_ru: Минимальная стоимость товаров при оптовой скидке

# Languages::ab__stickers.conditions.placeholders.min_qty_discount_percentage
source: Discount percentage with minimal quantity discount
ru_ru: Процент скидки при минимальной оптовой покупке

# Languages::ab__stickers.conditions.names.amount
source: In stock
ru_ru: В наличии

# Languages::ab__stickers.conditions.placeholders.amount
source: Product quantity in stock
ru_ru: Количество товара в наличии

# Languages::ab__stickers.conditions.names.sales_amount
source: Number of sales
ru_ru: Количество продаж

# Languages::ab__stickers.conditions.names.popularity
source: Product popularity
ru_ru: Популярность товара

# Languages::ab__stickers.conditions.names.rating
source: Product rating
ru_ru: Рейтинг товара

# Languages::ab__stickers.conditions.names.rating.tooltip
source: The value must be decimal
ru_ru: Введенное значение должно быть дробным

# Languages::ab__stickers.conditions.placeholders.rating
source: Product rating value, for example: 4.5 or 5.0
ru_ru: Значение рейтинга для товара, например: 4.5 или 5.0

# Languages::ab__stickers.conditions.names.comments
source: Number of reviews
ru_ru: Количество отзывов

# Languages::ab__stickers.conditions.names.comments.tooltip
source: Only accepted reviews will be counted
ru_ru: В расчет идут только принятые отзывы

# Languages::ab__stickers.conditions.names.pre_order
source: Buy in advance
ru_ru: Предзаказ

# Languages::ab__stickers.conditions.placeholders.avail_since
source: The date when buy in advance for product is available
ru_ru: Дата, с которой доступен предзаказ по товару

# Languages::ab__stickers.conditions.names.weight
source: Product weight
ru_ru: Вес товара

# Languages::ab__stickers.conditions.placeholders.weight
source: Product weight
ru_ru: Вес товара

# Languages::ab__stickers.conditions.placeholders.ceil_integer_weight
source: Product weight (rounded up to bigger integer number)
ru_ru: Вес товара (округленный к большему целому числу)

# Languages::ab__stickers.conditions.names.creating_date
source: Creating date
ru_ru: Дата создания

# Languages::ab__stickers.conditions.names.creating_date.tooltip
source: Number of the days from creation date of the product to current date
ru_ru: Количество дней от даты создания товара до текущей даты

# Languages::ab__stickers.conditions.names.age_verification
source: Age limit
ru_ru: Ограничение по возрасту

# Languages::ab__stickers.show
source: Display
ru_ru: Показывать

# Languages::ab__stickers.show.small
source: Display in the lists with small items
ru_ru: Показывать в списках с мелкими элементами

# Languages::ab__stickers.show.small.tooltip
source: Catalog lists:<br/>Small items;<br/>Text links;<br/>
ru_ru: Перечень списков:<br/>Мелкие элементы;<br/>Текстовые ссылки;<br/>

# Languages::ab__stickers.max_count
source: Maximal number
ru_ru: Максимальное количество

# Languages::ab__stickers.available_placeholders.header
source: Available placeholders
ru_ru: Доступные плейсхолдеры

# Languages::ab__stickers.default_placeholders
source: <p><code>[end_line]</code> - break line</p>
ru_ru: <p><code>[end_line]</code> - перенос строки</p>

# Languages::ab__stickers.conditions.names.promotion
source: Promotion
ru_ru: Промоакция

# Languages::ab__stickers.conditions.placeholders.price
source: Product price
ru_ru: Цена товара

# Languages::ab__stickers.border_width
source: Outline width
ru_ru: Ширина контура

# Languages::ab__stickers.border_color
source: Outline color
ru_ru: Цвет контура

# Languages::ab__stickers.uppercase_text
source: Text in capitals
ru_ru: Текст заглавными

# Languages::ab__stickers.available_tags.header
source: Available html tags and other entities
ru_ru: Доступные html-теги и другие сущности

# Languages::ab__stickers.available_tags
source: For fields Text for full view and Text for short view there are available some html tags and <a target="_blank" href="https://www.w3schools.com/charsets/ref_emoji.asp">Emoji Unicode</a>
ru_ru: Для полей Текст для полного вида и Текст для сокращенного вида Вам также доступны некоторые html-теги и <a target="_blank" href="https://www.w3schools.com/charsets/ref_emoji.asp">Emoji Unicode</a>

# Languages::ab__stickers.available_tags.content
source: Available tags:[available_tags] You can see examples after install of <a href="[href_demo]" target="_blank">demo data</a> or in <a href="https://docs.cs-cart.abt.team/en/ab__stickers.doc/#p-2891" target="_blank">documentation</a>
ru_ru: Доступные теги:[available_tags]Примеры использования Вы можете посмотреть, установив <a href="[href_demo]" target="_blank">демо-данные</a> или в <a href="https://docs.cs-cart.abt.team/ru/ab__stickers.doc/#p-2891" target="_blank">документации</a>

# Languages::ab__stickers.demodata
source: Demo data
ru_ru: Демо-данные

# Languages::ab__stickers.field_with_available_placeholders
source: For the field there are available placeholders, html tags and <a target="_blank" href="https://www.w3schools.com/charsets/ref_emoji.asp">Emoji Unicode</a>
ru_ru: Для этого поля доступно использование плейсхолдеров, html-тегов и <a target="_blank" href="https://www.w3schools.com/charsets/ref_emoji.asp">Emoji Unicode</a>

# Languages::ab__stickers.field_with_available_placeholders.wysiwyg
source: For the field there are available placeholders and html tags
ru_ru: Для этого поля доступно использование плейсхолдеров и html-тегов

# Languages::ab__stickers.full_size.image_size
source: Image size (full view)
ru_ru: Размер изображения (полный вид)

# Languages::ab__stickers.small_size.image_size
source: Image size (short view)
ru_ru: Размер изображения (сокращенный вид)

# Languages::ab__stickers.output_settings.tooltip
source: You can set sticker display on the product page and in different lists types (to display stickers properly in the lists with small product images)
ru_ru: Здесь Вы можете настроить отображение стикера на странице товара и в разных видах списков (для правильного отображения стикеров в списках с малыми изображениями товаров)

# Languages::ab__stickers.output_settings.not_display
source: Do not display
ru_ru: Не отображать

# Languages::ab__stickers.output_settings.small_size
source: Short view
ru_ru: Сокращенный вид

# Languages::ab__stickers.output_settings.full_size
source: Full view
ru_ru: Полный вид

# Languages::ab__stickers.delete_all
source: Delete all stickers
ru_ru: Удалить все стикеры

# Languages::ab__stickers.appearance_style
source: Appearance
ru_ru: Внешний вид

# Languages::ab__stickers.appearance_style.default.tooltip
source: Setting value 'Appearance' will be used from the tab 'Text stickers' of the add-on setting
ru_ru: Будет использовано значение настройки 'Внешний вид' со вкладки 'Текстовые стикеры' настройки модуля

# Languages::ab__stickers.appearance_style.rounded
source: Rounded
ru_ru: Скругленный

# Languages::ab__stickers.appearance_style.rectangular
source: Rectangular
ru_ru: Прямоугольный

# Languages::ab__stickers.appearance_style.teardrop
source: Teardrop
ru_ru: Каплевидный

# Languages::ab__stickers.appearance_style.beveled_angle
source: Beveled angle
ru_ru: Со скошенным углом

# Languages::ab__stickers.appearance_style.circle
source: Circle
ru_ru: Круглый

# Languages::ab__stickers.use_theme_presets
source: Use color values from the current theme
ru_ru: Использовать значения цветов из текущей темы

# Languages::ab__stickers.use_theme_presets.tooltip
source: Setting value "Discount label" will be used from settings <a href="[href]" target="_blank">of theme colors</a>
ru_ru: Будет использовано значение настройки "Лейбл со скидкой" из настроек <a href="[href]" target="_blank">цветов темы</a>

# Languages::ab__stickers.condition_groups.default
source: Default conditions
ru_ru: Общие условия

# Languages::ab__stickers.list_has_prohibited_positions
source: This list type consists of forbidden positions of display
ru_ru: Данный вид списка имеет запрещенные позиции отображения

# Languages::ab__stickers.list_has_prohibited_positions.docs
source: See the details in <a href="https://docs.cs-cart.abt.team/en/ab__stickers.doc/v1.2.0#p-3171" target="_blank">documentation</a>
ru_ru: Читайте подробнее в <a href="https://docs.cs-cart.abt.team/ru/ab__stickers.doc/v1.2.0#p-3171" target="_blank">документации</a>

# Languages::ab__stickers.vendor_edit
source: Allow vendor to manage
ru_ru: Разрешить управление продавцу

# Languages::ab__stickers.added_by_addon
source: Functionality is added by the add-on AB: Stickers
ru_ru: Функционал добавлен модулем AB: Стикеры

# Languages::ab__stickers.conditions.names.buy_together
source: Buy together
ru_ru: Комбинации товаров

# Languages::ab__stickers.conditions.names.buy_together.tooltip
source: Product consists of product combination
ru_ru: Товар имеет комбинацию товаров

# Languages::ab__stickers.conditions.names.discount_sum
source: Discount amount
ru_ru: Сумма скидки

# Languages::ab__stickers.conditions.placeholders.discount_sum
source: Discount amount in the selected currency
ru_ru: Сумма скидки в выбранной валюте

# Languages::ab__stickers.op_not_empty
source: not empty
ru_ru: не пусто

# Languages::ab__stickers.conditions.placeholders.feature_value
source: Feature value, where [id] is the identifier of the feature whose value you want to display
ru_ru: Значение характеристики, где [id] — идентификатор характеристики, значение которой нужно отобразить

# Languages::ab__stickers.sticker_bg.opacity
source: Background color saturation
ru_ru: Насыщенность цвета фона

# Languages::ab__stickers.font_family
source: Font
ru_ru: Шрифт

# Languages::ab__stickers.font_size
source: Text size, px
ru_ru: Размер текста, px

# Languages::ab__stickers.vertical_position
source: Vertical align
ru_ru: Вертикальное выравнивание

# Languages::ab__stickers.horizontal_position
source: Horizontal align
ru_ru: Горизонтальное выравнивание

# Languages::ab__stickers.vertical_margin
source: Padding vertically, px
ru_ru: Отступ по вертикали, рх

# Languages::ab__stickers.horizontal_margin
source: Padding horizontally, px
ru_ru: Отступ по горизонтали, рх

# Languages::ab__stickers.rotate
source: Rotation, &#176;
ru_ru: Поворот, &#176;

# Languages::ab__stickers.pictogram_vertical_position.VT
source: Top
ru_ru: Сверху

# Languages::ab__stickers.pictogram_vertical_position.VM
source: Center
ru_ru: По центру

# Languages::ab__stickers.pictogram_vertical_position.VB
source: Below
ru_ru: Снизу

# Languages::ab__stickers.pictogram_horizontal_position.HL
source: Left
ru_ru: Слева

# Languages::ab__stickers.pictogram_horizontal_position.HC
source: Center
ru_ru: По центру

# Languages::ab__stickers.pictogram_horizontal_position.HR
source: Right
ru_ru: Справа

# Languages::ab__stickers.pictogram.fonts
source: Font list
ru_ru: Список шрифтов

# Languages::ab__stickers.pictogram.fonts.add_font
source: Upload font(s)
ru_ru: Загрузить шрифт(ы)

# Languages::ab__stcikers.pictogram.font_download
source: Font(s)
ru_ru: Шрифт(ы)

# Languages::ab__stickers.pictogram.fonts.delete_all
source: Delete all selected fonts
ru_ru: Удалить все загруженные шрифты

# Languages::ab__stickers.pictogram.font_group.default
source: Standard fonts
ru_ru: Стандартные шрифты

# Languages::ab__stickers.pictogram.font_group.custom
source: Loaded fonts
ru_ru: Загруженные шрифты
