Repository: Bat-cyla/symmetrical-pancake
Catalog: var/langs/*/addons/ab__stickers.po
Languages: ru_ru

# Languages::ab__stcikers.pictogram.font_download.help
source: You may find fonts <a href='https://fonts.google.com/' target='_blank'>here</a>
ru_ru: Шрифты можно найти <a href='https://fonts.google.com/' target='_blank'>здесь</a>

# Languages::ab__stickers.pictograms.deleted_fonts
source: Scripts are removed
ru_ru: Шрифты удалены

# Languages::ab__stickers.pictograms.not_deleted_fonts
source: Some scripts cannot be removed as they are used in the following pictograms:<br>
ru_ru: Некоторые шрифты невозможно удалить, так как они используются в следующих пиктограммах:<br>

# Languages::ab__stickers.pictogram.help.text
source: You can use the following placeholders:<br><br><code>[feature_<b>***</b>_name]</code> - feature name.<br><br><code>[feature_***]</code> - feature value.<br><br><code>[feature_***_with_prefix]</code> - feature value with prefix.<br><br><code>[feature_***_with_suffix]</code> - feature value with suffix.<br><br><code>[feature_***_with_prefix_and_<br>suffix]</code> - feature value with prefix and suffix.<br><br><code>[feature_***_prefix]</code> - feature prefix.<br><br><code>[feature_***_suffix]</code> - feature suffix.<br><br>You can also use a special parameter <b>space</b> for placeholders<br><br><code>[feature_***_with_prefix]</code> ,<br><br><code>[feature_***_with_suffix]</code> ,<br><br><code>[feature_***_with_prefix_and_<br>suffix]</code> ,<br> to add spaces between prefix, value and suffix.<br><br>For example, <code>[feature_***_with_prefix|space]</code> (parameter <b>space</b> must be at the end of placeholder).<br><br>Where <code>***</code> is a feature identity (id)
ru_ru: Вы можете использовать следующие плейсхолдеры:<br><br><code>[feature_<b>***</b>_name]</code> - название характеристики.<br><br><code>[feature_***]</code> - значение характеристики.<br><br><code>[feature_***_with_prefix]</code> - значение характеристики с префиксом.<br><br><code>[feature_***_with_suffix]</code> - значение характеристики с суфиксом.<br><br><code>[feature_***_with_prefix_and_<br>suffix]</code> - значение характеристики с префиксом и суфиксом.<br><br><code>[feature_***_prefix]</code> - префикс характеристики.<br><br><code>[feature_***_suffix]</code> - суфикс характеристики.<br><br>Также можно использовать специальный параметр <b>space</b> для плейсхолдеров<br><br><code>[feature_***_with_prefix]</code> ,<br><br><code>[feature_***_with_suffix]</code> ,<br><br><code>[feature_***_with_prefix_and_<br>suffix]</code> ,<br> чтобы добавить отступы между префиксом, значеннием и суфиксом.<br><br>Например, <code>[feature_***_with_prefix|space]</code> (параметр <b>space</b> должен быть в конце плейсхолдера).<br><br>Где <code>***</code> идентификатор (id) характеристики

# Languages::ab__stickers.op_exist
source: exist
ru_ru: существует

# Languages::ab__stickers.text_stroke_width
source: Inking width
ru_ru: Ширина обводки

# Languages::ab__stickers.text_stroke_color
source: Inking color
ru_ru: Цвет обводки

# Languages::ab__stickers.pictogram.help.for_all_languages
source: Change color for all languages
ru_ru: Заменить текст для всех языков

# Languages::ab__stickers.conditions.names.company_id
source: Vendor
ru_ru: Продавец

# Languages::ab__stickers.object.select
source: Select sticker(-s)
ru_ru: Выберите стикер(-ы)

# Languages::ab__stickers.object.you_need_to_select_company
source: Please, select a Store to choose stickers
ru_ru: Пожалуйста, выберите Магазин для выбора стикеров

# Languages::ab__stickers.stickers_list.below
source: There is a sticker list that you can attach to the product
ru_ru: Ниже приведен список стикеров, которые Вы можете привязать к данному товару

# Languages::ab__stickers.attached_stickers
source: Attached stickers
ru_ru: Прикрепленные стикеры

# Languages::ab__stickers.attached_stickers.product_page.tooltip
source: Selected stickers will always be displayed on this product
ru_ru: Выбранные стикеры всегда будут отображены на данном товаре

# Languages::ab__stickers.attached_stickers.sticker_page.tooltip
source: The selected sticker will always be displayed on the pages of the following products
ru_ru: Выбранный стикер всегда будет отображен на страницах следующих товаров

# Languages::ab__stickers.find_available_stickers
source: Find available stickers
ru_ru: Найти доступные стикеры

# Languages::ab__stickers.errors.missed_fields
source: These fields are required and cannot be deleted
ru_ru: Эти поля обязательны и не могут быть удалены

# Languages::ab__stickers.link_generation
source: Links generation
ru_ru: Генерация связей

# Languages::ab__stickers.cron_jobs
source: Cron tasks
ru_ru: Cron задания

# Languages::ab__stickers.generation.description
source: To update deprecated information on Cron, use this command:
ru_ru: Для обновления устаревшей информации по Cron-у используйте эту команду:

# Languages::ab__stickers.generate.generated_ids.description
source: Generate sticker links to products|Generate stickers links to products
ru_ru: Сгенерировать связи стикера к товарам|Сгенерировать связи стикеров к товарам

# Languages::ab__stickers.generate.in_progress
source: Links generation
ru_ru: Генерация связей

# Languages::ab__stickers.generate.checking_generated
source: Check of generated links
ru_ru: Проверка уже сгенерированных связей

# Languages::ab__stickers.generate.prev_query_in_process
source: Updating of the links is in progress. The last change was made [last_time] seconds ago. Please, wait.
ru_ru: Обновление связей уже в процессе обработки. Последнее изменение зарегистрировано [last_time] сек назад. Пожалуйста, ожидайте.

# Languages::ab__stickers.generated_stickers
source: Generated stickers
ru_ru: Сгенерированные стикеры

# Languages::ab__stickers.generated_stickers.product_page.tooltip
source: These static stickers are attached to the product through the conditions
ru_ru: Данные статические стикеры прикреплены к товару через условия

# Languages::ab__stickers.successes.generated
source: Links for sticker [sticker] were generated successfully|Links for stickers <br/>[sticker]<br/> were generated successfully
ru_ru: Связи для стикера [sticker] успешно сгенерированы|Связи для стикеров:<br/>[sticker]<br/>успешно сгенерированы

# Languages::ab__stickers.errors.no_stickers_for_generation
source: There are no stickers to generate links<br/> Probable causes:<br/> You probably updated your links recently<br/> You have not static stickers with conditions
ru_ru: Нет стикеров для генерации связей.<br/>Вероятные причины:<br/>Вы недавно обновляли связи<br/>У Вас нет статических стикеров с созданными условиями

# Languages::ab__stickers.errors.no_pictograms_for_generation
source: No links for pictograms were found. <br>Possible reasons:<br/>You didn't update links for pictograms (stickers).<br/>Pictograms are already in a generation process.
ru_ru: Не найдено связей для генерации пиктограмм.<br>Вероятные причины:<br/>Вы не обновили связи для пиктограмм (стикеров).<br/>Пиктограммы уже в процессе генерации.

# Languages::ab__stickers.generated_for_sticker
source: <a href="[sticker_href]" target="_blank">[sticker]</a> <a href="[links_href]" target="_blank">number of links: [links]</a>
ru_ru: <a href="[sticker_href]" target="_blank">[sticker]</a> <a href="[links_href]" target="_blank">количество связей: [links]</a>

# Languages::ab__stickers.cron.generate_links_title
source: Links generation
ru_ru: Генерация связей

# Languages::ab__stickers.cron.generate_links_text
source: To update deprecated information on Cron, use this command:
ru_ru: Для обновления устаревшей информации по Cron-у используйте эту команду:

# Languages::ab__stickers.cron.generate_pictograms_title
source: Generate pictograms
ru_ru: Генерация пиктограмм

# Languages::ab__stickers.cron.generate_pictograms_text
source: Use this command to generate pictograms by Cron.<br><b>Limits</b><br>Use parameter <code>--limit</code> to specify a number of processing pictograms in 1 iteration.
ru_ru: Для генерации пиктограмм по Cron-у используйте эту команду.<br><b>Ограничения</b><br>Используйте параметр <code>--limit</code>, чтоб указать количество обрабатываемых пиктограмм за 1 итерацию.

# Languages::ab__stickers.notify_generate_links
source: Links generation
ru_ru: Генерация связей

# Languages::ab__stickers.notify_generate_pictograms
source: Generate pictograms
ru_ru: Генерация пиктограмм

# Languages::ab__stickers.pictogram.generated_pictogram
source: [sticker]: [count] products
ru_ru: [sticker]: [count] товаров

# Languages::ab__stickers.pictogram.generate_for_products
source: Generate pictograms for products
ru_ru: Сгенерировать пиктограммы для товаров

# Languages::ab__stickers.notify_limit
source: Up to [limit] records will be processed in one time.
ru_ru: За один раз будет обработано до [limit] записей

# Languages::ab__stickers.pictograms.successes_generated
source: The following pictograms are generated:<br><br>[sticker]
ru_ru: Сгенерировано следующие пиктограммы:<br><br>[sticker]

# Languages::ab__stickers.cron.limit_description
source: <b>Limits</b><br>Use parameter <code>--limit</code> to specify a number of processing pictograms in 1 iteration.
ru_ru: <b>Ограничения</b><br>Используйте параметр <code>--limit</code>, чтоб указать количество обрабатываемых пиктограмм за 1 итерацию.

# Languages::ab__stickers.demodata.description
source: On this page you can quickly add demo stickers
ru_ru: На этой странице Вы можете быстро добавить демо-стикеры

# Languages::ab__stickers.demodata.table.description
source: Demo data view
ru_ru: Вид демо-данных

# Languages::ab__stickers.demodata.table.add_stickers
source: Add demo stickers
ru_ru: Добавить демо-стикеры

# Languages::ab__stickers.demodata.install.success
source: Demo stickers were created successfully
ru_ru: Демо-стикеры были созданы успешно

# Languages::ab__stickers.demodata.download_graphic_stickers_source
source: If you wish to change demo stickers (e.g., background color of the sticker), you may download correspond source images by <a href="https://drive.google.com/drive/folders/1VnZIlP0X6ES2UYUZXNiQWvc9G_tDr6KA" target="_blank">reference</a>
ru_ru: Если Вы желаете изменить демо-стикеры (например, цвет фона стикеров), Вы можете скачать соответствующие исходные изображения по <a href="https://drive.google.com/drive/folders/1VnZIlP0X6ES2UYUZXNiQWvc9G_tDr6KA" target="_blank">ссылке</a>

# Languages::ab__stickers_import
source: AB: Stickers: Import
ru_ru: AB: Стикеры: Импорт

# Languages::ab__stickers_export
source: AB: Stickers: Export
ru_ru: AB: Стикеры: Экспорт

source: AB: Stickers: Display pictograms
ru_ru: AB: Стикеры: Отображать пиктограммы

source: Do not display
ru_ru: Не отображать

source: Position 1
ru_ru: Позиция 1

source: Position 2
ru_ru: Позиция 2

source: AB: Stickers: Display pictograms
ru_ru: AB: Стикеры: Отображать пиктограммы

source: Do not display
ru_ru: Не отображать

source: Position 1
ru_ru: Позиция 1

source: Position 2
ru_ru: Позиция 2

source: Do not display
ru_ru: Не отображать

# Languages::abt__ut2.settings.product_list.short_list.ab__s_pictogram_position
source: AB: Stickers: Display pictograms
ru_ru: AB: Стикеры: Отображать пиктограммы

# Languages::abt__ut2.settings.products.view.ab__s_pictogram_position
source: AB: Stickers: Display pictograms
ru_ru: AB: Стикеры: Отображать пиктограммы

# Languages::abt__ut2.settings.products.view.ab__s_pictogram_position.variants.n
source: Do not display
ru_ru: Не отображать

source: Position 1
ru_ru: Позиция 1

source: Position 2
ru_ru: Позиция 2

# Languages::abt__yt.settings.products.ab__s_pictogram_position
source: AB: Stickers: Display pictograms
ru_ru: AB: Стикеры: Отображать пиктограммы

# Languages::abt__yt.settings.product_list.ab__s_pictogram_position
source: AB: Stickers: Display pictograms
ru_ru: AB: Стикеры: Отображать пиктограммы

# Languages::abt__yt.settings.product_list.ab__s_pictogram_position.variants.n
source: Do not display
ru_ru: Не отображать

source: Position 1
ru_ru: Позиция 1

# Languages::abt__yt.settings.products.ab__s_pictogram_position.variants.n
source: Do not display
ru_ru: Не отображать

source: Position 1
ru_ru: Позиция 1
