Repository: Bat-cyla/symmetrical-pancake
Catalog: var/langs/*/addons/cp_dev_debug_switcher.po
Languages: ru_ru

# Addons::name::cp_dev_debug_switcher
source: Cart-Power: Debug switcher [DEV HELPER]
ru_ru: Cart-Power: Переключатель режима отладки [DEV HELPER]

# Addons::description::cp_dev_debug_switcher
source: Toggles debug mode and development mode with error display. Developed by <a target="_blank" href="https://cart-power.com/">Cart-Power</a>
ru_ru: Переключает режим отладки и режим разработки с отображением ошибок. Разработано <a target="_blank" href="https://cart-power.ru/">Cart-Power</a>

# SettingsSections::cp_dev_debug_switcher::general
source: General
ru_ru: Общее

# Languages::cp_dev_debug_switcher.enable_debug_mode
source: Enable debug mode
ru_ru: Включить режим отладки

# Languages::cp_dev_debug_switcher.enable_debug_mode_desc
source: Activate <code>DEBUG_MODE</code>.
ru_ru: Активирует <code>DEBUG_MODE</code>.

# Languages::cp_dev_debug_switcher.enable_debug_mode_desc_notice
source: <code>DEBUG_MODE</code> is already defined outside of the add-on. Debug mode switching functionality is disabled. Check your settings in the config files.
ru_ru: <code>DEBUG_MODE</code> уже активирован вне модуля. Функциональность переключения режима отладки отключена. Проверьте свои настройки в файлах конфигурации.

# Languages::cp_dev_debug_switcher.enable_development_mode
source: Enable develop mode
ru_ru: Включить режим разработки

# Languages::cp_dev_debug_switcher.enable_development_mode_desc
source: Activate <code>DEVELOPMENT</code>, <code>display_errors</code>, <code>display_startup_errors</code>.
ru_ru: Активирует <code>DEVELOPMENT</code>, <code>display_errors</code>, <code>display_startup_errors</code>.

# Languages::cp_dev_debug_switcher.enable_development_mode_notice
source: <code>DEVELOPMENT</code> is already defined outside of the module. The development mode switching functionality is limited. Check your settings in the config files. <p>When switching setting, only <code>display_errors</code>, <code>display_startup_errors</code> will be activated.</p>
ru_ru: <code>DEVELOPMENT</code> уже активирован вне модуля. Функциональность переключения режима разработки ограничена. Проверьте свои настройки в файлах конфигурации. <p>При переключении настройки будут активироваться только <code>display_errors</code>, <code>display_startup_errors</code>.</p>

# Languages::cp_dev_debug_switcher.enable_error_logging
source: Enable error logging
ru_ru: Включить логирование ошибок

# Languages::cp_dev_debug_switcher.enable_error_logging_desc
source: Enables logging errors, warnings and notices to a separate errors.log file in the module folder.
ru_ru: Включает запись ошибок, предупреждений и уведомлений в отдельный файл errors.log в папку модуля.

# Languages::cp_dev_debug_switcher.download_log_file
source: Download log file
ru_ru: Скачать лог файл

# Languages::cp_dev_debug_switcher.delete_log_file
source: Delete log file
ru_ru: Удалить лог файл

# Languages::cp_dev_debug_switcher.delete_file_log.success
source: Log file deleted successfully.
ru_ru: Файл логирования успешно удален.

# Languages::cp_dev_debug_switcher.current_state
source: Current state
ru_ru: Текущее состояние

# Languages::cp_dev_debug_switcher.mail_to
source: To
ru_ru: Кому

# Languages::cp_dev_debug_switcher.mail_from
source: From
ru_ru: От кого

# Languages::cp_dev_debug_switcher.logger_mail
source: Intercepted email notifications
ru_ru: Перехваченные email уведомления

# Languages::cp_dev_debug_switcher.logs
source: Intercepted email notifications
ru_ru: Перехваченные email уведомления

# Languages::cp_dev_debug_switcher.current_server_time
source: Current server time
ru_ru: Текущее серверное время

# Languages::cp_dev_debug_switcher.php_info
source: PHP Information
ru_ru: Информация о PHP

# Languages::cp_dev_debug_switcher.save_mail_message
source: Enable email interception
ru_ru: Включить перехват email

# Languages::cp_dev_debug_switcher.save_mail_message_desc
source: Blocks the sending of email notifications and intercepts them.
ru_ru: Блокирует отправку email уведомлений и осуществляет их перехват.

# Languages::cp_dev_debug_switcher.works_from_ip
source: Restrict modes for IP
ru_ru: Ограничить режимы для IP

# Languages::cp_dev_debug_switcher.works_from_ip_desc
source: Enables debug and development modes only for the specified IPs.
ru_ru: Активирует режимы отладки и разработки только для указанных IP-адресов.

# Languages::cp_dev_debug_switcher.works_from_ip_help_desc
source: Make sure the IP address is entered correctly using four groups of numbers separated by dots. For multiple IP addresses, use a comma delimiter (e.g., 192.168.0.1,192.168.0.2).
ru_ru: Убедитесь, что IP-адрес введен правильно, используя четыре группы чисел, разделенных точками. Для нескольких IP-адресов используйте разделитель запятую (например, 192.168.0.1,192.168.0.2).

# Languages::cp_dev_debug_switcher.ip_matches
source: Your current IP address matches one of the following
ru_ru: Ваш текущий IP-адрес соответствует одному из указанных

# Languages::cp_dev_debug_switcher.ip_not_matches
source: Your current IP address does not match any of the specified ones
ru_ru: Ваш текущий IP-адрес не соответствует ни одному из указанных

# Languages::cp_dev_debug_switcher.uninstall_full
source: Full remove
ru_ru: Удалить полностью
